system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           GAMG;
        smoother         GaussSeidel;
        tolerance        1e-8;
        relTol           0.01;
    }

    "(U|k|epsilon|omega)"
    {
        //solver           smoothSolver;
        //smoother         GaussSeidel;
        //tolerance        1e-8;
        //relTol           0.01;
		
		solver           PBiCGStab;
        preconditioner   DILU; // Un buen preacondicionador para PBiCGStab
        tolerance        1e-8; 
        relTol           0; //
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 2;
    consistent               true;
    pRefCell                 0;
    pRefValue                0;
	
	//residualControl
    //{
    //    p_rgh         			1e-3;
    //    U             			1e-4;
	//	  T             			1e-4;
    //    h             			1e-4;
    //    w             			1e-4;
    //    "(k|epsilon)" 			1e-4;
    //}
}

relaxationFactors
{
    fields
    {
        p               	 0.3; // AGREGAR ESTO para controlar la oscilación de presión
    }
	equations
    {
        U                    0.7; //0.9;
        "(k|epsilon|omega)"  0.4; //0.7;
    }
}

cache
{
    grad(U);
}


// ************************************************************************* //
